// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число  (в першу, другу, третю или четверту частину години).

// let time = +prompt('введіть потрібну хвилину');
// if (time >= 0 && time < 15) {
//     console.log('це перша чверть!')
// } else if (time >= 15 && time < 30) {
//     console.log('це друга чверть')
// } else if (time >= 30 && time < 45) {
//     console.log('це третя чверть')
// } else if (time >= 45 && time <= 59) {
//     console.log('це четверта чверть')
// } else {
//     console.log('введіть правильний час!!!')
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

// let day = prompt('введіть день місяця');
// if (day > 0 && day <= 10) {
//     console.log('перша декада')
// } else if (day > 10 && day <= 20) {
//     console.log('друга декада')
// } else if (day > 20 && day <= 31) {
//     console.log('третя декада')
// } else {
//     console.log('введіть вірні дані')
// }

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти
//     скрипта - з коротким записом(тернаркою)
//
// let test = true;
// // let test = false;
// // if (test){
// //     console.log('Вірно')
// // } else {
// //     console.log('Неправильно')
// // }

// let test = true;
// (test) ? console.log('Вірно') : console.log('Неправильно');
// (!test) ? console.log('Вірно') : console.log('Неправильно');

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що
// дорівнює 1, 0, -3

// let a = +prompt('введіть число: 1 або 0 або -3');
// if (a !== 0) {
//     console.log('вірно')
// } else {
//     console.log('Невірно')
// }

// (+prompt('введіть число: 1 або 0 або -3') !== 0) ? console.log('вірно') : console.log('Невірно');

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день.

// let day = +prompt('введіть поточний день тижня');
// switch (day){
//     case 1:
//         console.log('понеділок: відхідний після вихідних');
//         break;
//     case 2:
//         console.log('вівторок: підготовка до робочого дня');
//         break;
//     case 3:
//         console.log('середа: тупо працюєм!!!');
//         break;
//     case 4:
//         console.log('четвер: відходимо після робочого дня');
//         break;
//     case 5:
//         console.log('пятниця: підготовка до вихідних');
//         break;
//     case 6:
//         console.log('субота: вихідний!!!');
//         break;
//     case 7:
//         console.log('неділя: вихідний!!!!!');
//         break;
//     default:
//         console.log('які ще можуть бути питання по робочому графіку!!!')
// }
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('введіть рік');
// if (year % 4 === 0){
//     console.log('рік високосний')
// } else {
//     console.log('рік не високосний')
// }

// (+prompt('введіть рік') % 4 === 0) ? console.log('рік високосний') : console.log('рік не високосний');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let nameJS = prompt('яка "офіційна" назва JavaScript?');
// let nameJSToUp = nameJS.toUpperCase();
// if (nameJSToUp === 'ECMASCRIPT'){
//     console.log('правильно!')
// } else {
//     console.log('"Не знаєте? ECMAScript!"')
// }