// - Дано натуральное число n. Выведите все числа от 1 до n.

// function rec(a) {
//     if (a === 1) {
//         return "1";
//     }
//     return rec(a - 1) + " " + a;
// }
// console.log(rec(77));


// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания,
// если A < B, или в порядке убывания в противном случае.

// function rec(a, b) {
//     if (a > b) {
//         if (a === b) {
//             return a;
//         }
//         return a + " " + rec(a - 1, b);
//     } else {
//         if (a === b) {
//             return a;
//         }
//         return a + " " + rec(a + 1, b);
//     }
// }
// console.log(rec(10, 20));
// console.log(rec(20, 10));


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]


// let change = (arr, i) => {
//     let x = arr[i];
//     arr[i] = arr[i + 1];
//     arr[i + 1] = x;
//     console.log(arr);
// };
// change([9, 8, 0, 4], 2);


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву.
// Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

// let moveZero = (arr) => {
//     let x = arr.length;
//     for (let i = 0; i < x; i++) {
//         if (arr[i] === 0) {
//             arr.push(0);
//             arr.splice(i, 1);
//             x--;
//             i--;
//         }
//     }
//     return arr;
// }
// console.log(moveZero([9, 0, true, 0, 'asd', 0, 0, 0, 0, 14, 11, 2, 3, 8, 0, 4]));






