//    - Користувач вводить або має два числа.
//        Потрібно знайти та вивести максимальне число з тих двох .
//        Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('введіть перше число');
// let b = +prompt('введіть друге число');
// if (a < b) {
//     console.log(b)
// }
// if (a > b) {
//     console.log(a)
// }
// if (a === b) {
//     console.log('Ви ввели рівні числа')
// }

//    - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//    Користувач вводить номер квартири просто в змінні або через prompt('') .
//        Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let a = +prompt('введіть номер квартири');
// if (a > 0 && a <= 20) {
//     console.log('підїзд №1')
// } else if (a > 20 && a <= 48) {
//     console.log('підїзд №2')
// } else if (a > 48 && a <= 90) {
//     console.log('підїзд №3')
// } else {
//     console.log('вибачте, Ви помилилися, введіть інший номер')
// }

//    - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
//      якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('задайте числове значення');
// if (number === 10) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')
// }


//    - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//        якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//    якщо в змінну записали щось інше, спрацьовує else

// let x = 9;
// let x = 'sdfgh';
// let x = true;
// let x = {};
// let x = [];

// if (typeof x === "number") {
//     console.log(1)
// } else if (typeof x === "string") {
//     console.log(2)
// } else if (typeof x === "boolean") {
//     console.log(3)
// } else if (typeof x === "object") {
//     console.log(3)
// } else {
//     console.log('error')
// }

//    - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//        Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//        Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = prompt('введіть температуру на даний момент');
// if (temperature >= 10 && temperature <= 22){
//     console.log('йдемо сьогодні в OKTEN на навчання!!!')
// } else {
//     console.log('на жаль сидимо вдома і вчимося(((')
// }

//    - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від
//    введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести
//    Повідомлення - що число не вірне ... .

// let number = +prompt('введіть Ваше число(від 1 до 5)');
// switch (number) {
//     case 1:
//         console.log('вітаємо Ви виграли АВТО');
//         break;
//     case 2:
//         console.log('вітаємо Ви виграли МОТО');
//         break;
//     case 3:
//         console.log('вітаємо Ви виграли NOKIA 3310');
//         break;
//     case 4:
//         console.log('вітаємо Ви виграли ВІДПОЧИНОК');
//         break;
//     case 5:
//         console.log('вітаємо Ви виграли КУРС НАВЧАННЯ В OKTEN SCHOOL')
//         break;
//         default:
//             console.log('будь ласка введіть число від 1 до 5!')
// }