// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому
// 3 і більше елементи. Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х
// елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let friends = ["Ivan", "Slavik"];
// if (friends.length >= 3){
//     console.log('це великий масив, в якому 3 і більше елементів')
// } else {
//     console.log('це маленький масив, у якому менше 3-х елементів')
// }

//          -----------------------тернарка--------------------
// (friends.length >= 3) ? console.log('це великий масив, в якому 3 і більше елементів') : console.log('це ' +
//     'маленький масив, у якому менше 3-х елементів')


// Маємо 3 числа і між ним  нам потрібно знайти те що посередині. Знайти, яке з них є середнім (більше одного,
// але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = +prompt('введіть число A');
// let b = +prompt('введіть число B');
// let c = +prompt('введіть число C');
// if ((b < a && a < c) || (c < a && a < b)) {
//     console.log(a);
// } else if ((a < b && b < c) || (c < b && b < a)) {
//     console.log(b);
// } else if ((a < c && c < b) || (b < c && c < a)) {
//     console.log(c);
// } else {
//     console.log('введіть різні числа')
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
//
// let result;
// let a = 2;
// let b = 1;
// ((a + b) < 4) ? result = 'мало' : result = 'багато';
// console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number = +prompt('введіть число');
// if (number > 0){
//     console.log('позитивне')
// } else if (number < 0){
//     console.log('негативне')
// } else if (number === 0){
//     console.log('Ви ввели 0 :-)')
// } else {
//     console.log('Ви щось не те тицьнули....')
// }

//          -----------------------тернарка--------------------
// (number > 0) ? console.log('позитивне') : (number < 0) ? console.log('негативне') : (number === 0) ? console.log('Ви' +
//     'ввели 0 :-)') : console.log('Ви щось не туди тицьнули....')